# Students: Yuying Zhou, Xirong Cao

In [1]:
%load_ext sql

## &#x23f5; Initialize database

In [2]:
%sql sqlite:///lab4.db3

'Connected: @lab4.db3'

## Q1: A is a superkey for a relation (A, B, C, D)

**Step 1. create two tables T and F, T satisfies the requirement, F fails the requirement** <br>
**Step 2. write SQL test two tables**

### *&#x23f5; create table T and F and Insert Values*

In [3]:
%%sql
drop table if exists T;
create table T (
ID int NOT NULL,
FN varchar(50) NOT NULL,
LN varchar(50) NOT NULL,
Type varchar(50) NOT NULL
);

insert into T( ID, FN, LN, Type) values
(1, "Itachi", "Uchiha", "Fire"),
(2, "Kisame", "Hoshigaki", "Water"),
(3, "Naruto", "Uzumaki", "Wind"),
(4, "Sasuke", "Uchiha", "Lighting"),
(5, "Nara", "Shikamaru", "Negative")
;

drop table if exists F;
create table F (
A INT NOT NULL,
B varchar (50) NOT NULL,
C varchar (50) NOT NULL,
D varchar (50) NOT NULL
 );

insert into F(
A, B, C, D)
VALUES 
(1,'Big Brother','gangster', '25'),
(1, 'Little Brother', 'gangster', '25'),
(2,'C++','programming', '37'),
(3,'Water','human', 'inf'),
(3,'Water','plants', 'inf'),
(4,'Jazz','music', '101'),
(4, 'Jazz', 'music', '96')
;

 * sqlite:///lab4.db3
Done.
Done.
5 rows affected.
Done.
Done.
7 rows affected.

[]

### &#x23f5; *Display Tables*

In [4]:
%%sql
select * from T

 * sqlite:///lab4.db3
Done.

[(1, 'Itachi', 'Uchiha', 'Fire'),
 (2, 'Kisame', 'Hoshigaki', 'Water'),
 (3, 'Naruto', 'Uzumaki', 'Wind'),
 (4, 'Sasuke', 'Uchiha', 'Lighting'),
 (5, 'Nara', 'Shikamaru', 'Negative')]

In [5]:
%%sql
select * from F

 * sqlite:///lab4.db3
Done.

[(1, 'Big Brother', 'gangster', '25'),
 (1, 'Little Brother', 'gangster', '25'),
 (2, 'C++', 'programming', '37'),
 (3, 'Water', 'human', 'inf'),
 (3, 'Water', 'plants', 'inf'),
 (4, 'Jazz', 'music', '101'),
 (4, 'Jazz', 'music', '96')]

### &#x23f5; *Testing SQL F* 
*self-join tables and check if there are more than one distinct attributes(B, C, D) for A*

In [6]:
%%sql
select * from F as f1, F as f2
where f1.A = f2.A
group by f1.A
having count(distinct(f2.B)) > 1 or count(distinct(f2.C)) > 1 or count(distinct(f2.D)) > 1

 * sqlite:///lab4.db3
Done.

[(1, 'Big Brother', 'gangster', '25', 1, 'Big Brother', 'gangster', '25'),
 (3, 'Water', 'human', 'inf', 3, 'Water', 'human', 'inf'),
 (4, 'Jazz', 'music', '101', 4, 'Jazz', 'music', '101')]

### &#x23f5; *Testing SQL T*

In [7]:
%%sql
select * from T as t1, T as t2
where t1.ID = t2.ID
group by t1.ID
having count(distinct(t2.FN)) > 1 or count(distinct(t2.LN)) > 1 or count(distinct(t2.Type)) > 1

 * sqlite:///lab4.db3
Done.

[]

----

## Q2: The combinations of two attributes in the relation T (A, B, C, D) are each keys

**Step 1. create four tables** <br>
**Step 2. write SQL testing tables(A, B) -> (A, B, C, D) and (B, C) -> (A, B, C, D)**

### *&#x23f5; create tables and Insert value testing for (A, B)*

In [8]:
%%sql
drop table if exists F1q2;
create table F1q2 (
A INT NOT NULL,
B varchar (50) NOT NULL,
C varchar (50) NOT NULL,
D varchar (50) NOT NULL
 );


insert into F1q2(
A, B, C, D)
VALUES 
(1, 'music', 'Jazz', '96'),
(1, 'music', 'Jazz', '49'),
(2, 'nature', 'Water', '3'),
(2, 'nature', 'Fire', '3'),
(3, 'jojo', 'jotaro', '40')
;

drop table if exists T1q2;
create table T1q2 (
A INT NOT NULL,
B varchar (50) NOT NULL,
C varchar (50) NOT NULL,
D varchar (50) NOT NULL
 );

insert into T1q2(
A, B, C, D)
VALUES 
(1, 'music', 'Jazz', '96'),
(1, 'music', 'Jazz', '96'),
(2, 'nature', 'Water', '3'),
(2, 'nature', 'Water', '3'),
(3, 'jojo', 'jotaro', '40')
;

 * sqlite:///lab4.db3
Done.
Done.
5 rows affected.
Done.
Done.
5 rows affected.

[]

### &#x23f5; *Display Tables*

In [9]:
%%sql
select * from T1q2

 * sqlite:///lab4.db3
Done.

[(1, 'music', 'Jazz', '96'),
 (1, 'music', 'Jazz', '96'),
 (2, 'nature', 'Water', '3'),
 (2, 'nature', 'Water', '3'),
 (3, 'jojo', 'jotaro', '40')]

In [10]:
%%sql 
select * from F1q2

 * sqlite:///lab4.db3
Done.

[(1, 'music', 'Jazz', '96'),
 (1, 'music', 'Jazz', '49'),
 (2, 'nature', 'Water', '3'),
 (2, 'nature', 'Fire', '3'),
 (3, 'jojo', 'jotaro', '40')]

### &#x23f5; *Testing SQL for T1*

In [11]:
%%sql
select * from T1q2 as t1, T1q2 as t2
where t1.A = t2.A
and t1.B = t2.B
group by t1.A
having count(distinct(t2.C)) > 1 or count(distinct(t2.D)) > 1

 * sqlite:///lab4.db3
Done.

[]

### &#x23f5; *Testing SQL for F1*

In [12]:
%%sql
select * from F1q2 as f1, F1q2 as f2
where f1.A = f2.A
and f1.B = f2.B
group by f1.A
having count(distinct(f2.C)) > 1 or count(distinct(f2.D)) > 1

 * sqlite:///lab4.db3
Done.

[(1, 'music', 'Jazz', '96', 1, 'music', 'Jazz', '49'),
 (2, 'nature', 'Water', '3', 2, 'nature', 'Fire', '3')]

### *&#x23f5; create tables testing for (B, C)*

In [13]:
%%sql
drop table if exists F2q2;
create table F2q2 (
A INT NOT NULL,
B varchar (50) NOT NULL,
C varchar (50) NOT NULL,
D varchar (50) NOT NULL
 );

insert into F2q2(
A, B, C, D)
VALUES 
('Jazz', 'music', 1, '96'),
('Jazz', 'music', 1, '49'),
('Water', 'nature', 2, '3'),
('Fire', 'nature', 2, '3'),
('jotaro', 'jojo', 3, '40')
;

drop table if exists T2q2;
create table T2q2 (
A INT NOT NULL,
B varchar (50) NOT NULL,
C varchar (50) NOT NULL,
D varchar (50) NOT NULL
 );

insert into T2q2(
A, B, C, D)
VALUES 
('Jazz', 'music', 1, '96'),
('Jazz', 'music', 1, '96'),
('Water', 'nature', 2, '3'),
('Water', 'nature', 2, '3'),
('jotaro', 'jojo', 3, '40')
;

 * sqlite:///lab4.db3
Done.
Done.
5 rows affected.
Done.
Done.
5 rows affected.

[]

### &#x23f5; *Display Tables*

In [14]:
%%sql
select * from T2q2

 * sqlite:///lab4.db3
Done.

[('Jazz', 'music', '1', '96'),
 ('Jazz', 'music', '1', '96'),
 ('Water', 'nature', '2', '3'),
 ('Water', 'nature', '2', '3'),
 ('jotaro', 'jojo', '3', '40')]

In [15]:
%%sql
select * from F2q2

 * sqlite:///lab4.db3
Done.

[('Jazz', 'music', '1', '96'),
 ('Jazz', 'music', '1', '49'),
 ('Water', 'nature', '2', '3'),
 ('Fire', 'nature', '2', '3'),
 ('jotaro', 'jojo', '3', '40')]

### &#x23f5; *Testing SQL for T2*

In [16]:
%%sql
select * from T2q2 as t1, T2q2 as t2
where t1.B = t2.B
and t1.C = t2.C
group by t1.C
having count(distinct(t2.A)) > 1 or count(distinct(t2.D)) > 1

 * sqlite:///lab4.db3
Done.

[]

### &#x23f5; *Testing SQL for F2*

In [17]:
%%sql
select * from F2q2 as f1, F2q2 as f2
where f1.B = f2.B
and f1.C = f2.C
group by f1.C
having count(distinct(f2.A)) > 1 or count(distinct(f2.D)) > 1

 * sqlite:///lab4.db3
Done.

[('Jazz', 'music', '1', '96', 'Jazz', 'music', '1', '49'),
 ('Water', 'nature', '2', '3', 'Fire', 'nature', '2', '3')]

----

## Q3: Tuple-Generating Dependency (TGD) 
**step 1. create Sailors and Reserves tables** <br>
**step 2. check existence when the shared attributes in relation A equal the same attributes in relation B**

### *&#x23f5; create tables Saliors and Reserves that satisfy the conditions*

In [18]:
%%sql 
drop table if exists Sailors;
create table Sailors(sid int primary key,sname varchar(20),rating varchar(5),age int);

insert into Sailors values(1,'david','4',22);
insert into Sailors values(2,'jojo','5',26);
insert into Sailors values(3,'jason','3',31);
insert into Sailors values(4,'kelly','5',27);
insert into Sailors values(5,'arno','2',36);
insert into Sailors values(6,'lisa','1',23);

drop table if exists Reserves;
create table Reserves(sid int,bid int,day date,primary key(sid,bid,day));
insert into Reserves values(1,101,'03-20-2022');
insert into Reserves values(1,106,'04-26-2022');
insert into Reserves values(2,110,'05-02-2022');
insert into Reserves values(3,103,'03-26-2022');
insert into Reserves values(4,112,'04-10-2022');
insert into Reserves values(2,111,'04-17-2022');
insert into Reserves values(2,111,'04-08-2022');
insert into Reserves values(5,107,'04-25-2022');
insert into Reserves values(6,111,'03-28-2022');
insert into Reserves values(4,101,'04-12-2022');
insert into Reserves values(3,112,'04-05-2022');
insert into Reserves values(5,111,'03-23-2022');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### *&#x23f5; create tables Saliors and Reserves that does not satisfy conditions*

In [19]:
%%sql 
drop table if exists Sailors2;
create table Sailors2(sid int primary key,sname varchar(20),rating varchar(5),age int);

insert into Sailors2 values(1,'david','4',22);
insert into Sailors2 values(2,'jojo','5',26);
insert into Sailors2 values(3,'jason','3',31);
insert into Sailors2 values(4,'kelly','5',27);
insert into Sailors2 values(5,'arno','2',36);
insert into Sailors2 values(6,'lisa','1',23);

drop table if exists Reserves2;
create table Reserves2(sid int,bid int,day date,primary key(sid,bid,day));
insert into Reserves2 values(1,101,'03-20-2022');
insert into Reserves2 values(1,106,'04-26-2022');
insert into Reserves2 values(2,110,'05-02-2022');
insert into Reserves2 values(3,103,'03-26-2022');
insert into Reserves2 values(4,112,'04-10-2022');
insert into Reserves2 values(7,111,'04-17-2022');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### *&#x23f5; Display tables*

In [20]:
%%sql
select * from sailors

 * sqlite:///lab4.db3
Done.

[(1, 'david', '4', 22),
 (2, 'jojo', '5', 26),
 (3, 'jason', '3', 31),
 (4, 'kelly', '5', 27),
 (5, 'arno', '2', 36),
 (6, 'lisa', '1', 23)]

In [21]:
%%sql
select * from reserves

 * sqlite:///lab4.db3
Done.

[(1, 101, '03-20-2022'),
 (1, 106, '04-26-2022'),
 (2, 110, '05-02-2022'),
 (3, 103, '03-26-2022'),
 (4, 112, '04-10-2022'),
 (2, 111, '04-17-2022'),
 (2, 111, '04-08-2022'),
 (5, 107, '04-25-2022'),
 (6, 111, '03-28-2022'),
 (4, 101, '04-12-2022'),
 (3, 112, '04-05-2022'),
 (5, 111, '03-23-2022')]

In [22]:
%%sql
select * from reserves2

 * sqlite:///lab4.db3
Done.

[(1, 101, '03-20-2022'),
 (1, 106, '04-26-2022'),
 (2, 110, '05-02-2022'),
 (3, 103, '03-26-2022'),
 (4, 112, '04-10-2022'),
 (7, 111, '04-17-2022')]

### &#x23f5; *Testing for Tables that satisfy conditions*

In [23]:
%%sql 
select s.sid 
from sailors as s
where not exists(
    select r.sid from reserves as r 
    where s.sid = r.sid)

 * sqlite:///lab4.db3
Done.

[]

### &#x23f5; *Testing for Tables that does not satisfy conditions*

In [24]:
%%sql 
select s.sid 
from sailors2 as s
where not exists(
    select r.sid from reserves2 as r 
    where s.sid = r.sid)

 * sqlite:///lab4.db3
Done.

[(5,), (6,)]

----

## Q4: Multivalued Dependency (MVD)
**step 1. create three tables R, X and Y where X &#x2286; R and Y &#x2286; R, but X ≠ Y** <br>
**step 2. write SQL that according to the definition of MVD** <br>
*• t<sub>3</sub>[X] = t<sub>1</sub>[X] =  t<sub>2</sub>[X]* <br>
*• t<sub>3</sub>[Y] = t<sub>1</sub>[Y]* <br>
*• t<sub>3</sub>[R \ Y] = t<sub>2</sub>[R \ Y]* <br>
**Simplify: R = {A, B, C, D, E}, X = {A, B, C}, Y = {C, D, E}**

In [25]:
%%sql
drop table if exists T1;
create table T1 (
A INT NOT NULL,
B varchar (50) NOT NULL,
C varchar (50) NOT NULL,
D varchar (50) NOT NULL,
E varchar (50) NOT NULL
 );

insert into T1
(A, B, C, D, E) values
(1, 'jojo1', 'Jonathan', 'Hamon', 'Young Dio'),
(2, 'jojo2', 'Joseph', 'Hermit Purple', 'Kazi'),
(3, 'jojo3', 'Jotaro', 'Star Platinum', 'Old Dio'),
(4, 'jojo4', 'Josuke', 'Crazy Diamond', 'Kira Yoshikage'),
(5, 'jojo5', 'Jolyne', 'Stone Free', 'Pucci')
;

drop table if exists T2;
create table T2 (
A INT NOT NULL,
B varchar (50) NOT NULL,
C varchar (50) NOT NULL
 );

insert into T2
(A, B, C) values
(1, 'jojo1', 'Jonathan'),
(2, 'jojo2', 'Joseph'),
(3, 'jojo3', 'Jotaro'),
(4, 'jojo4', 'Josuke'),
(5, 'jojo5', 'Jolyne')
;

drop table if exists T3;
create table T3 (
C varchar (50) NOT NULL,
D varchar (50) NOT NULL,
E varchar (50) NOT NULL
 );

insert into T3
(C, D, E) values
('J', 'Hamon', 'Young Dio'),
('Joseph', 'Hermit Purple', 'Kazi'),
('Jotaro', 'Star Platinum', 'Old Dio'),
('Josuke', 'Crazy Diamond', 'Kira Yoshikage'),
('Jolyne', 'Stone Free', 'Pucci')
;

drop table if exists T4;
create table T4 (
A varchar (50) NOT NULL,
C varchar (50) NOT NULL,
D varchar (50) NOT NULL
 );

insert into T4
(A, C, D) values
(1, 'Jonathan', 'Hamon'),
(2, 'Joseph', 'Hermit Purple'),
(3, 'Jotaro', 'Star Platinum'),
(4, 'Josuke', 'Crazy Diamond'),
(5, 'Jolyne', 'Stone Free')
;

 * sqlite:///lab4.db3
Done.
Done.
5 rows affected.
Done.
Done.
5 rows affected.
Done.
Done.
5 rows affected.
Done.
Done.
5 rows affected.

[]

### *&#x23f5; Display tables*

In [26]:
%%sql
select * from t1

 * sqlite:///lab4.db3
Done.

[(1, 'jojo1', 'Jonathan', 'Hamon', 'Young Dio'),
 (2, 'jojo2', 'Joseph', 'Hermit Purple', 'Kazi'),
 (3, 'jojo3', 'Jotaro', 'Star Platinum', 'Old Dio'),
 (4, 'jojo4', 'Josuke', 'Crazy Diamond', 'Kira Yoshikage'),
 (5, 'jojo5', 'Jolyne', 'Stone Free', 'Pucci')]

In [27]:
%%sql
select * from t2

 * sqlite:///lab4.db3
Done.

[(1, 'jojo1', 'Jonathan'),
 (2, 'jojo2', 'Joseph'),
 (3, 'jojo3', 'Jotaro'),
 (4, 'jojo4', 'Josuke'),
 (5, 'jojo5', 'Jolyne')]

In [28]:
%%sql
select * from t3

 * sqlite:///lab4.db3
Done.

[('J', 'Hamon', 'Young Dio'),
 ('Joseph', 'Hermit Purple', 'Kazi'),
 ('Jotaro', 'Star Platinum', 'Old Dio'),
 ('Josuke', 'Crazy Diamond', 'Kira Yoshikage'),
 ('Jolyne', 'Stone Free', 'Pucci')]

In [29]:
%%sql
select * from t4

 * sqlite:///lab4.db3
Done.

[('1', 'Jonathan', 'Hamon'),
 ('2', 'Joseph', 'Hermit Purple'),
 ('3', 'Jotaro', 'Star Platinum'),
 ('4', 'Josuke', 'Crazy Diamond'),
 ('5', 'Jolyne', 'Stone Free')]

### &#x23f5; *Testing for Tables T4 that satisfy conditions*

In [30]:
%%sql
select * 
from t1, t2
where t1.A = t2.A
and not exists (select * from t4
               where t1.A = t4.A
               and t1.C = t4.C
               and t1.D = t4.D)

 * sqlite:///lab4.db3
Done.

[]

### &#x23f5; *Testing for Tables T3 that doesn't satisfy conditions*

In [31]:
%%sql
select * 
from t1, t2
where t1.C = t2.C
and not exists (select * from t3
               where t1.C = t3.C
               and t1.E = t3.E
               and t1.D = t3.D)

 * sqlite:///lab4.db3
Done.

[(1, 'jojo1', 'Jonathan', 'Hamon', 'Young Dio', 1, 'jojo1', 'Jonathan')]